# TAKE HOME LAB EXERCISE

In [0]:
import pandas as pd

-----------------------

**Q.no (1) . Write a code to load 'employees.csv' as `df`.**

In [2]:
from google.colab import files
uploaded = files.upload()

Saving employees.csv to employees.csv

In [37]:
import io
df = pd.read_csv(io.BytesIO(uploaded['employees.csv']))
df.head()

   Id     F_Name    S_Name  ... Years_Exp   Location Salary
0   1      Brown       Mia  ...         7  Bangalore  10000
1   2  LaRotonda  William   ...         8  Bangalore  10000
2   3     Steans  Tyrone    ...         7  Bangalore  10000
3   4     Howard   Estelle  ...         4  Bangalore  15000
4   5      Singh      Nan   ...         9  Bangalore  15000

[5 rows x 10 columns]

----------------

**Q.no(2).Write a code to `MERGE`(`outer`)  df1 & df2 as `data`.**

----------------

**Q.no(3) . Write a code to `RENAME` the column from `salary` to `earnings`  of `employees dataset` and assign it to the new dataframe named as `data_01` .**

In [36]:
data_01 = df.rename(columns={'Salary':'Earnings'})
data_01.head()

   Id     F_Name    S_Name  ... Years_Exp   Location Earnings
0   1      Brown       Mia  ...         7  Bangalore    10000
1   2  LaRotonda  William   ...         8  Bangalore    10000
2   3     Steans  Tyrone    ...         7  Bangalore    10000
3   4     Howard   Estelle  ...         4  Bangalore    15000
4   5      Singh      Nan   ...         9  Bangalore    15000

[5 rows x 10 columns]

-----------------

**Q.no(4) . Write a code to `drop` the column 'DOB' of `employees dataset` and assign it to the new dataframe named as `data_02`.**

In [20]:
data_02 = df.drop(columns='DOB')
data_02.head()

   Id     F_Name    S_Name  ... Years_Exp   Location Salary
0   1      Brown       Mia  ...         7  Bangalore  10000
1   2  LaRotonda  William   ...         8  Bangalore  10000
2   3     Steans  Tyrone    ...         7  Bangalore  10000
3   4     Howard   Estelle  ...         4  Bangalore  15000
4   5      Singh      Nan   ...         9  Bangalore  15000

[5 rows x 9 columns]

-----------------

**Q.no(5) . Write a code to `drop` the `column no. 3 ` of `data_02` as per there `index position` .**

In [21]:
data_02.drop([3]).head(3)

   Id     F_Name    S_Name   Sex  ...   Designation Years_Exp   Location Salary
0   1      Brown       Mia  Male  ...  Accountant I         7  Bangalore  10000
1   2  LaRotonda  William   Male  ...  Accountant I         8  Bangalore  10000
2   3     Steans  Tyrone    Male  ...  Accountant I         7  Bangalore  10000

[3 rows x 9 columns]

-----------------

**Q.no(6). Write a code to replace all the `1` in the `year of experience` to `2` of `data_02`and assign it to the new dataframe named as `data_03`.**

In [29]:
data_03 = data_02['Years_Exp'].replace(1,2)
data_03

0     7
1     8
2     7
3     4
4     9
5     3
6     2
7     4
8     5
9     3
10    4
11    6
12    4
13    5
14    3
15    6
16    2
17    3
18    4
19    5
20    4
21    6
22    5
23    7
24    8
25    7
26    5
27    4
28    5
29    5
30    5
31    5
32    5
33    9
34    8
35    6
36    5
37    6
38    4
39    4
40    5
41    6
42    6
43    3
44    6
45    7
46    5
47    6
48    4
49    4
Name: Years_Exp, dtype: int64

-----------------

**Q.no(7). Write a code to identify duplicates in `Designation` column and show a `count` of it from `data_02`.**

In [33]:
data_02['Designation'].value_counts()

Database Administrator      13
Network Engineer             9
IT Support                   4
Sr. DBA                      4
Sr. Network Engineer         3
Administrative Assistant     3
Accountant I                 3
IT Manager - DB              2
Sr. Accountant               2
Shared Services Manager      2
IT Manager - Support         1
CIO                          1
IT Manager - Infra           1
President & CEO              1
IT Director                  1
Name: Designation, dtype: int64

--------------

**Q.no(8). Write a code to show `average` `salary` of all the employees.**

In [39]:
df['Salary'].mean()

63700.0

---------------

**Q.no(9). Write a code to show mostly `designated position` for all the employees from employees dataset.**

In [76]:
df['Designation'].value_counts().head(1).index[0]

'Database Administrator'

----------------

**Q.no(10). Write a code to show the `average salary` for all `individual` `'designations'`.**

In [80]:
df.groupby('Designation').agg({'Salary':'mean'}).reset_index(0)

                 Designation  Salary
0               Accountant I   10000
1   Administrative Assistant   15000
2                        CIO  120000
3     Database Administrator   50000
4                IT Director   75000
5            IT Manager - DB   75000
6         IT Manager - Infra   75000
7       IT Manager - Support   75000
8                 IT Support   80000
9           Network Engineer   85000
10           President & CEO  120000
11   Shared Services Manager   20000
12            Sr. Accountant   20000
13                   Sr. DBA   95000
14      Sr. Network Engineer  100000

-----------------

**Q.no(11). Write a code to show how much do the `salary` is `skewed` in `employees dataset`.**

In [81]:
df["Salary"].skew()

-0.32966939158331143

-------------------------

**Q.no(12). Write a code to show how much is the `kurtosis` in `salary` column for employees dataset.**

In [82]:
df["Salary"].kurtosis()

-0.8674403189534878

# --------------------------------------- HAPPY LEARNING --------------------------------------------

--------------------